# FilterStringContains Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringContains Class
Members See Also
---
Tests whether string values from the document contain a certain string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterStringContains : FilterStringRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterStringContains _
	Inherits FilterStringRuleEvaluator
```

Visual C++
---
```text
public ref class FilterStringContains : public FilterStringRuleEvaluator
```

# Remarks
All string comparisons in this class are performed in the case-insensitive manner.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterStringRuleEvaluator Autodesk.Revit.DB..::..FilterStringContains
# See Also
FilterStringContains Members
Autodesk.Revit.DB Namespace